Update Netflix_video_streaming_2.md
